lains/stm32-linky-display/src/main.cpp
/* Includes ------------------------------------------------------------------*/
#include "Stm32SerialDriver.h"
#include "Stm32LcdDriver.h"
#include "TIC/Unframer.h"
#include "PowerHistory.h"
#include "TicFrameParser.h"

extern "C" {
#include "main.h"
#include <stdio.h>
#include "font58.h"

static void SystemClock_Config(void); /* Defined below */
}

/* Private define ------------------------------------------------------------*/
const unsigned int LCDWidth = 800;
const unsigned int LCDHeight = 480;
const unsigned int BytesPerPixel = 4; /* For ARGB8888 mode */

#define VSYNC               1 
#define VBP                 1 
#define VFP                 1
#define VACT                LCDHeight
#define HSYNC               1
#define HBP                 1
#define HFP                 1
#define HACT                LCDWidth

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

//static uint32_t ImageIndex = 0;
/*static const uint32_t * Images[] = 
{
    image_320x240_argb8888,
    life_augmented_argb8888,
};*/

/**
  * @brief  On Error Handler on condition TRUE.
  * @param  condition : Can be TRUE or FALSE
  * @retval None
  */
void OnError_Handler(uint32_t condition)
{
    if(condition) {
        BSP_LED_On(LED2);
        while(1) { ; } /* Blocking on error */
    }
}

void Error_Handler() {
	  OnError_Handler(1);
}

typedef void(*FHalDelayRefreshFunc)(void* context);

/**
 * @brief Wait for a given delay in ms, while running a function in background
 * 
 * @param toRunWhileWaiting A function to run continously while waiting
 * @param context A context pointer provided to toRunWhileWaiting as argument
 * @param Delay The delay to wait for (in ms)
 * 
 */
void waitDelay(uint32_t Delay, FHalDelayRefreshFunc toRunWhileWaiting = nullptr, void* context = nullptr) {
    uint32_t tickstart = HAL_GetTick();
    uint32_t wait = Delay;

    /* Add a freq to guarantee minimum wait */
    if (wait < HAL_MAX_DELAY) {
        wait += (uint32_t)(uwTickFreq);
    }

    while((HAL_GetTick() - tickstart) < wait) {
        if (toRunWhileWaiting != nullptr) {
            toRunWhileWaiting(context);
        }
    }
}

struct TicProcessingContext {
    /* Default constructor */
    TicProcessingContext(Stm32SerialDriver& ticSerial, TIC::Unframer& ticUnframer) :
        ticSerial(ticSerial),
        ticUnframer(ticUnframer),
        lostTicBytes(0),
        serialRxOverflowCount(0),
        instantaneousPower(static_cast<uint32_t>(-1)),
        lastParsedFrameNb(static_cast<unsigned int>(-1)) { }

/* Attributes */
    Stm32SerialDriver& ticSerial; /*!< The encapsulated TIC serial bytes receive handler */
    TIC::Unframer& ticUnframer;   /*!< The encapsulated TIC frame delimiter handler */
    unsigned int lostTicBytes;    /*!< How many TIC bytes were lost due to forwarding queue overflow? */
    unsigned int serialRxOverflowCount;  /*!< How many times we didnot read fast enough the serial buffer and bytes where thus lost due to incoming serial buffer overflow */
    uint32_t instantaneousPower;    /*!< A place to store the instantaneous power measurement */
    unsigned int lastParsedFrameNb; /*!< The ID of the last received TIC frame */
};



void drawHistory(Stm32LcdDriver& lcd, uint16_t x, uint16_t y, uint16_t width, uint16_t height, const PowerHistory& history) {
    unsigned int nbSamples = width; /* Initially try to fill-in all the area */
    PowerHistoryEntry powerMeasurements[nbSamples];
    history.getLastPower(nbSamples, powerMeasurements);
    if (nbSamples > width) {    /* Sanity, should never occur */
        nbSamples = width;
    }
    uint8_t pos = 0;
    char statusLine[]="DH=@@@@";
    pos+=3; // "DH="
    statusLine[pos++]=(nbSamples / 1000) % 10 + '0';
    statusLine[pos++]=(nbSamples / 100) % 10 + '0';
    statusLine[pos++]=(nbSamples / 10) % 10 + '0';
    statusLine[pos++]=(nbSamples / 1) % 10 + '0';
    pos++;
    auto get_font24_ptr = [](const char c) {
        unsigned int bytesPerGlyph = Font24.Height * ((Font24.Width + 7) / 8);
        return &(Font24.table[(c-' ') * bytesPerGlyph]);
    };
    
    lcd.drawText(0, 4*24, statusLine, Font24.Width, Font24.Height, get_font24_ptr, Stm32LcdDriver::LCD_Color::White, Stm32LcdDriver::LCD_Color::Black);

    for (unsigned int measurementAge = 0; measurementAge < nbSamples; measurementAge++) {
        uint16_t thisSampleAbsoluteX = x + width - measurementAge;   /* First measurement sample is at the extreme right of the allocated area, next samples will be placed to the left */
        PowerHistoryEntry& thisSampleEntry = powerMeasurements[measurementAge];
        TicEvaluatedPower& thisSamplePower = thisSampleEntry.power;
        if (thisSamplePower.isValid) {
            const int maxPower = 3000;
            const int minPower = -1500;
            uint16_t zeroSampleAbsoluteY = y;
            zeroSampleAbsoluteY += (static_cast<unsigned long int>(maxPower) * static_cast<unsigned long int>(height) / static_cast<unsigned long int>(maxPower - minPower));
            uint16_t thisSampleTopAbsoluteY = 0;
            uint16_t thisSampleBottomAbsoluteY = 0;
            if (thisSamplePower.maxValue > 0) { /* Positive value, even if range, display the highest value of the range (worst case) */
                uint16_t thisSampleMaxRelativeY = 0;
                if (thisSamplePower.maxValue > 0) { /* Positive and exact power */
                    thisSampleMaxRelativeY = (static_cast<unsigned long int>(thisSamplePower.maxValue) / static_cast<unsigned long int>(maxPower - minPower));
                    thisSampleTopAbsoluteY = zeroSampleAbsoluteY - thisSampleMaxRelativeY;
                    thisSampleBottomAbsoluteY = thisSampleBottomAbsoluteY;
                }
                lcd.drawVerticalLine(thisSampleAbsoluteX, thisSampleTopAbsoluteY, thisSampleBottomAbsoluteY-thisSampleTopAbsoluteY, Stm32LcdDriver::Red);
            }
            else {  /* Max value is negative, we are injecting, display the range */
                uint16_t thisSampleMaxRelativeY = 0;
                uint16_t thisSampleMinRelativeY = 0;
                bool maxIsBelow0 = (thisSamplePower.maxValue > 0);
                bool minIsBelow0 = (thisSamplePower.minValue > 0);
                unsigned int maxAbsValue = maxIsBelow0?-thisSamplePower.maxValue:thisSamplePower.maxValue;
                unsigned int minAbsValue = minIsBelow0?-thisSamplePower.minValue:thisSamplePower.minValue;
                thisSampleMaxRelativeY = (static_cast<unsigned int>(maxAbsValue) / static_cast<unsigned int>(maxPower - minPower));
                thisSampleMinRelativeY = (static_cast<unsigned int>(minAbsValue) / static_cast<unsigned int>(maxPower - minPower));
                uint16_t thisSampleTopAbsoluteY = 0;
                uint16_t thisSampleBottomAbsoluteY = 0;
                if (maxIsBelow0)
                    thisSampleTopAbsoluteY = zeroSampleAbsoluteY + thisSampleMaxRelativeY;
                else
                    thisSampleTopAbsoluteY = zeroSampleAbsoluteY - thisSampleMaxRelativeY;
                if (minIsBelow0)
                    thisSampleBottomAbsoluteY = zeroSampleAbsoluteY + thisSampleMinRelativeY;
                else
                    thisSampleBottomAbsoluteY = zeroSampleAbsoluteY - thisSampleMinRelativeY;
                
                if (thisSampleTopAbsoluteY > thisSampleBottomAbsoluteY) {   /* Failsafe, should not occur */
                    std::swap(thisSampleTopAbsoluteY, thisSampleBottomAbsoluteY);
                }
                lcd.drawVerticalLine(thisSampleAbsoluteX, thisSampleTopAbsoluteY, thisSampleBottomAbsoluteY-thisSampleTopAbsoluteY, Stm32LcdDriver::Green);
            }
        }
    }
}

/**
 * @brief  Main program
 */
int main(void) {
    /* STM32F4xx HAL library initialization:
      - Configure the Flash prefetch, instruction and Data caches
      - Systick timer is configured by default as source of time base, but user 
        can eventually implement his proper time base source (a general purpose 
        timer for example or other time source), keeping in mind that Time base 
        duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and 
        handled in milliseconds basis.
      - Set NVIC Group Priority to 4
      - Low Level Initialization: global MSP (MCU Support Package) initialization
    */
    HAL_Init();
  
    /* Configure the system clock to 180 MHz */
    SystemClock_Config();

    /* Configure LED1, LED2, LED3 and LED4 */
    BSP_LED_Init(LED1);
    BSP_LED_Init(LED2);
    BSP_LED_Init(LED3);
    BSP_LED_Init(LED4);
    BSP_LED_On(LED2);
    waitDelay(250);
    BSP_LED_Off(LED2);

